RT-Thread/rt-thread/bsp/swm320-lq100/Libraries/SWM320_StdPeriph_Driver/SWM320_pwm.c
/******************************************************************************************************************************************
* 文件名称: SWM320_pwm.c
* 功能说明: SWM320单片机的PWM功能驱动库
* 技术支持: http://www.synwit.com.cn/e/tool/gbook/?bid=1
* 注意事项:
* 版本日期: V1.1.0      2017年10月25日
* 升级记录:
*
*
*******************************************************************************************************************************************
* @attention
*
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS WITH CODING INFORMATION
* REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME. AS A RESULT, SYNWIT SHALL NOT BE HELD LIABLE
* FOR ANY DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE CONTENT
* OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING INFORMATION CONTAINED HEREIN IN CONN-
* -ECTION WITH THEIR PRODUCTS.
*
* COPYRIGHT 2012 Synwit Technology
*******************************************************************************************************************************************/
#include "SWM320.h"
#include "SWM320_pwm.h"

/******************************************************************************************************************************************
* 函数名称: PWM_Init()
* 功能说明: PWM初始化
* 输    入: PWM_TypeDef * PWMx      指定要被设置的PWM，有效值包括PWM0、PWM1、PWM2、PWM3、PWM4、PWM5
*           PWM_InitStructure * initStruct  包含PWM相关设定值的结构体
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void PWM_Init(PWM_TypeDef *PWMx, PWM_InitStructure *initStruct)
{
    uint32_t bit_offset = 0;

    SYS->CLKEN |= (0x01 << SYS_CLKEN_PWM_Pos);

    SYS->CLKDIV &= ~SYS_CLKDIV_PWM_Msk;
    SYS->CLKDIV |= (initStruct->clk_div << SYS_CLKDIV_PWM_Pos);

    PWM_Stop(PWMx, 1, 1); //一些关键寄存器只能在PWM停止时设置

    PWMx->MODE = initStruct->mode;

    PWMx->PERA = initStruct->cycleA;
    PWMx->HIGHA = initStruct->hdutyA;
    PWMx->DZA = initStruct->deadzoneA;

    PWMx->PERB = initStruct->cycleB;
    PWMx->HIGHB = initStruct->hdutyB;
    PWMx->DZB = initStruct->deadzoneB;

    PWMx->INIOUT &= ~(PWM_INIOUT_PWMA_Msk | PWM_INIOUT_PWMB_Msk);
    PWMx->INIOUT |= (initStruct->initLevelA << PWM_INIOUT_PWMA_Pos) |
                    (initStruct->initLevelB << PWM_INIOUT_PWMB_Pos);

    PWMG->IM = 0x00000000;

    switch ((uint32_t)PWMx)
    {
    case ((uint32_t)PWM0):
        bit_offset = 0;
        break;

    case ((uint32_t)PWM1):
        bit_offset = 2;
        break;

    case ((uint32_t)PWM2):
        bit_offset = 4;
        break;

    case ((uint32_t)PWM3):
        bit_offset = 6;
        break;

    case ((uint32_t)PWM4):
        bit_offset = 8;
        break;

    case ((uint32_t)PWM5):
        bit_offset = 10;
        break;
    }

    PWMG->IRS = ((0x01 << bit_offset) | (0x01 << (bit_offset + 1)) | (0x01 << (bit_offset + 12)) | (0x01 << (bit_offset + 13))); //清除中断标志
    PWMG->IE &= ~((0x01 << bit_offset) | (0x01 << (bit_offset + 1)) | (0x01 << (bit_offset + 12)) | (0x01 << (bit_offset + 13)));
    PWMG->IE |= (initStruct->NCycleAIEn << bit_offset) | (initStruct->NCycleBIEn << (bit_offset + 1)) |
                (initStruct->HEndAIEn << (bit_offset + 12)) | (initStruct->HEndBIEn << (bit_offset + 13));

    if (initStruct->NCycleAIEn | initStruct->NCycleBIEn | initStruct->HEndAIEn | initStruct->HEndBIEn)
    {
        NVIC_EnableIRQ(PWM_IRQn);
    }
    else if ((PWMG->IE & (~((0x01 << bit_offset) | (0x01 << (bit_offset + 1)) | (0x01 << (bit_offset + 12)) | (0x01 << (bit_offset + 13))))) == 0)
    {
        NVIC_DisableIRQ(PWM_IRQn);
    }
}

/******************************************************************************************************************************************
* 函数名称: PWM_Start()
* 功能说明: 启动PWM，开始PWM输出
* 输    入: PWM_TypeDef * PWMx      指定要被设置的PWM，有效值包括PWM0、PWM1、PWM2、PWM3、PWM4、PWM5
*           uint32_t chA            0 通道A不启动       1 通道A启动
*           uint32_t chB            0 通道B不启动       1 通道B启动
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void PWM_Start(PWM_TypeDef *PWMx, uint32_t chA, uint32_t chB)
{
    switch ((uint32_t)PWMx)
    {
    case ((uint32_t)PWM0):
        PWMG->CHEN |= (chA << PWMG_CHEN_PWM0A_Pos) | (chB << PWMG_CHEN_PWM0B_Pos);
        break;

    case ((uint32_t)PWM1):
        PWMG->CHEN |= (chA << PWMG_CHEN_PWM1A_Pos) | (chB << PWMG_CHEN_PWM1B_Pos);
        break;

    case ((uint32_t)PWM2):
        PWMG->CHEN |= (chA << PWMG_CHEN_PWM2A_Pos) | (chB << PWMG_CHEN_PWM2B_Pos);
        break;

    case ((uint32_t)PWM3):
        PWMG->CHEN |= (chA << PWMG_CHEN_PWM3A_Pos) | (chB << PWMG_CHEN_PWM3B_Pos);
        break;

    case ((uint32_t)PWM4):
        PWMG->CHEN |= (chA << PWMG_CHEN_PWM4A_Pos) | (chB << PWMG_CHEN_PWM4B_Pos);
        break;

    case ((uint32_t)PWM5):
        PWMG->CHEN |= (chA << PWMG_CHEN_PWM5A_Pos) | (chB << PWMG_CHEN_PWM5B_Pos);
        break;
    }
}

/******************************************************************************************************************************************
* 函数名称: PWM_Stop()
* 功能说明: 关闭PWM，停止PWM输出
* 输    入: PWM_TypeDef * PWMx      指定要被设置的PWM，有效值包括PWM0、PWM1、PWM2、PWM3、PWM4、PWM5
*           uint32_t chA            0 通道A不关闭       1 通道A关闭
*           uint32_t chB            0 通道B不关闭       1 通道B关闭
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void PWM_Stop(PWM_TypeDef *PWMx, uint32_t chA, uint32_t chB)
{
    switch ((uint32_t)PWMx)
    {
    case ((uint32_t)PWM0):
        PWMG->CHEN &= ~((chA << PWMG_CHEN_PWM0A_Pos) | (chB << PWMG_CHEN_PWM0B_Pos));
        break;

    case ((uint32_t)PWM1):
        PWMG->CHEN &= ~((chA << PWMG_CHEN_PWM1A_Pos) | (chB << PWMG_CHEN_PWM1B_Pos));
        break;

    case ((uint32_t)PWM2):
        PWMG->CHEN &= ~((chA << PWMG_CHEN_PWM2A_Pos) | (chB << PWMG_CHEN_PWM2B_Pos));
        break;

