RT-Thread/rt-thread/bsp/swm320-lq100/Libraries/SWM320_StdPeriph_Driver/SWM320_pwm.c
    case ((uint32_t)PWM3):
        PWMG->CHEN &= ~((chA << PWMG_CHEN_PWM3A_Pos) | (chB << PWMG_CHEN_PWM3B_Pos));
        break;

    case ((uint32_t)PWM4):
        PWMG->CHEN &= ~((chA << PWMG_CHEN_PWM4A_Pos) | (chB << PWMG_CHEN_PWM4B_Pos));
        break;

    case ((uint32_t)PWM5):
        PWMG->CHEN &= ~((chA << PWMG_CHEN_PWM5A_Pos) | (chB << PWMG_CHEN_PWM5B_Pos));
        break;
    }
}

/******************************************************************************************************************************************
* 函数名称: PWM_SetCycle()
* 功能说明: 设置周期
* 输    入: PWM_TypeDef * PWMx      指定要被设置的PWM，有效值包括PWM0、PWM1、PWM2、PWM3、PWM4、PWM5
*           uint32_t chn            选择要设置哪个通道，有效值：PWM_CH_A、PWM_CH_B
*           uint16_t cycle          要设定的周期值
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void PWM_SetCycle(PWM_TypeDef *PWMx, uint32_t chn, uint16_t cycle)
{
    if (chn == PWM_CH_A)
        PWMx->PERA = cycle;
    else if (chn == PWM_CH_B)
        PWMx->PERB = cycle;
}

/******************************************************************************************************************************************
* 函数名称: PWM_GetCycle()
* 功能说明: 获取周期
* 输    入: PWM_TypeDef * PWMx      指定要被设置的PWM，有效值包括PWM0、PWM1、PWM2、PWM3、PWM4、PWM5
*           uint32_t chn            选择要查询哪个通道，有效值：PWM_CH_A、PWM_CH_B
* 输    出: uint16_t                获取到的周期值
* 注意事项: 无
******************************************************************************************************************************************/
uint16_t PWM_GetCycle(PWM_TypeDef *PWMx, uint32_t chn)
{
    uint16_t cycle = 0;

    if (chn == PWM_CH_A)
        cycle = PWMx->PERA;
    else if (chn == PWM_CH_B)
        cycle = PWMx->PERB;

    return cycle;
}

/******************************************************************************************************************************************
* 函数名称: PWM_SetHDuty()
* 功能说明: 设置高电平时长
* 输    入: PWM_TypeDef * PWMx      指定要被设置的PWM，有效值包括PWM0、PWM1、PWM2、PWM3、PWM4、PWM5
*           uint32_t chn            选择要设置哪个通道，有效值：PWM_CH_A、PWM_CH_B
*           uint16_t hduty          要设定的高电平时长
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void PWM_SetHDuty(PWM_TypeDef *PWMx, uint32_t chn, uint16_t hduty)
{
    if (chn == PWM_CH_A)
        PWMx->HIGHA = hduty;
    else if (chn == PWM_CH_B)
        PWMx->HIGHB = hduty;
}

/******************************************************************************************************************************************
* 函数名称: PWM_GetHDuty()
* 功能说明: 获取高电平时长
* 输    入: PWM_TypeDef * PWMx      指定要被设置的PWM，有效值包括PWM0、PWM1、PWM2、PWM3、PWM4、PWM5
*           uint32_t chn            选择要查询哪个通道，有效值：PWM_CH_A、PWM_CH_B
* 输    出: uint16_t                获取到的高电平时长
* 注意事项: 无
******************************************************************************************************************************************/
uint16_t PWM_GetHDuty(PWM_TypeDef *PWMx, uint32_t chn)
{
    uint16_t hduty = 0;

    if (chn == PWM_CH_A)
        hduty = PWMx->HIGHA;
    else if (chn == PWM_CH_B)
        hduty = PWMx->HIGHB;

    return hduty;
}

/******************************************************************************************************************************************
* 函数名称: PWM_SetDeadzone()
* 功能说明: 设置死区时长
* 输    入: PWM_TypeDef * PWMx      指定要被设置的PWM，有效值包括PWM0、PWM1、PWM2、PWM3、PWM4、PWM5
*           uint32_t chn            选择要设置哪个通道，有效值：PWM_CH_A、PWM_CH_B
*           uint8_t deadzone        要设定的死区时长
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void PWM_SetDeadzone(PWM_TypeDef *PWMx, uint32_t chn, uint8_t deadzone)
{
    if (chn == PWM_CH_A)
        PWMx->DZA = deadzone;
    else if (chn == PWM_CH_B)
        PWMx->DZB = deadzone;
}

/******************************************************************************************************************************************
* 函数名称: PWM_GetDeadzone()
* 功能说明: 获取死区时长
* 输    入: PWM_TypeDef * PWMx      指定要被设置的PWM，有效值包括PWM0、PWM1、PWM2、PWM3、PWM4、PWM5
*           uint32_t chn            选择要查询哪个通道，有效值：PWM_CH_A、PWM_CH_B
* 输    出: uint8_t                 获取到的死区时长
* 注意事项: 无
******************************************************************************************************************************************/
uint8_t PWM_GetDeadzone(PWM_TypeDef *PWMx, uint32_t chn)
{
    uint8_t deadzone = 0;

    if (chn == PWM_CH_A)
        deadzone = PWMx->DZA;
    else if (chn == PWM_CH_B)
        deadzone = PWMx->DZB;

    return deadzone;
}

/******************************************************************************************************************************************
* 函数名称: PWM_IntNCycleEn()
* 功能说明: 新周期开始中断使能
* 输    入: PWM_TypeDef * PWMx      指定要被设置的PWM，有效值包括PWM0、PWM1、PWM2、PWM3、PWM4、PWM5
*           uint32_t chn            选择要设置哪个通道，有效值：PWM_CH_A、PWM_CH_B
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void PWM_IntNCycleEn(PWM_TypeDef *PWMx, uint32_t chn)
{
    switch ((uint32_t)PWMx)
    {
    case ((uint32_t)PWM0):
        if (chn == PWM_CH_A)
            PWMG->IE |= (0x01 << PWMG_IE_NEWP0A_Pos);
        else
            PWMG->IE |= (0x01 << PWMG_IE_NEWP0B_Pos);
        break;

    case ((uint32_t)PWM1):
        if (chn == PWM_CH_A)
            PWMG->IE |= (0x01 << PWMG_IE_NEWP1A_Pos);
        else
            PWMG->IE |= (0x01 << PWMG_IE_NEWP1B_Pos);
        break;

    case ((uint32_t)PWM2):
        if (chn == PWM_CH_A)
            PWMG->IE |= (0x01 << PWMG_IE_NEWP2A_Pos);
        else
            PWMG->IE |= (0x01 << PWMG_IE_NEWP2B_Pos);
        break;

    case ((uint32_t)PWM3):
        if (chn == PWM_CH_A)
            PWMG->IE |= (0x01 << PWMG_IE_NEWP3A_Pos);
        else
            PWMG->IE |= (0x01 << PWMG_IE_NEWP3B_Pos);
        break;

    case ((uint32_t)PWM4):
        if (chn == PWM_CH_A)
            PWMG->IE |= (0x01 << PWMG_IE_NEWP4A_Pos);
        else
            PWMG->IE |= (0x01 << PWMG_IE_NEWP4B_Pos);
        break;

    case ((uint32_t)PWM5):
        if (chn == PWM_CH_A)
            PWMG->IE |= (0x01 << PWMG_IE_NEWP5A_Pos);
        else
            PWMG->IE |= (0x01 << PWMG_IE_NEWP5B_Pos);
        break;
    }
}

/******************************************************************************************************************************************
* 函数名称: PWM_IntNCycleDis()
* 功能说明: 新周期开始中断禁能
* 输    入: PWM_TypeDef * PWMx      指定要被设置的PWM，有效值包括PWM0、PWM1、PWM2、PWM3、PWM4、PWM5
*           uint32_t chn            选择要设置哪个通道，有效值：PWM_CH_A、PWM_CH_B
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void PWM_IntNCycleDis(PWM_TypeDef *PWMx, uint32_t chn)
{
    switch ((uint32_t)PWMx)
    {
    case ((uint32_t)PWM0):
        if (chn == PWM_CH_A)
            PWMG->IE &= ~(0x01 << PWMG_IE_NEWP0A_Pos);
        else
            PWMG->IE &= ~(0x01 << PWMG_IE_NEWP0B_Pos);
        break;

    case ((uint32_t)PWM1):
        if (chn == PWM_CH_A)
            PWMG->IE &= ~(0x01 << PWMG_IE_NEWP1A_Pos);
        else
            PWMG->IE &= ~(0x01 << PWMG_IE_NEWP1B_Pos);
        break;

    case ((uint32_t)PWM2):
        if (chn == PWM_CH_A)
            PWMG->IE &= ~(0x01 << PWMG_IE_NEWP2A_Pos);
        else
            PWMG->IE &= ~(0x01 << PWMG_IE_NEWP2B_Pos);
        break;

