RT-Thread/rt-thread/bsp/swm320-lq100/Libraries/SWM320_StdPeriph_Driver/SWM320_pwm.c
    case ((uint32_t)PWM3):
        if (chn == PWM_CH_A)
            PWMG->IE &= ~(0x01 << PWMG_IE_HEND3A_Pos);
        else
            PWMG->IE &= ~(0x01 << PWMG_IE_HEND3B_Pos);
        break;

    case ((uint32_t)PWM4):
        if (chn == PWM_CH_A)
            PWMG->IE &= ~(0x01 << PWMG_IE_HEND4A_Pos);
        else
            PWMG->IE &= ~(0x01 << PWMG_IE_HEND4B_Pos);
        break;

    case ((uint32_t)PWM5):
        if (chn == PWM_CH_A)
            PWMG->IE &= ~(0x01 << PWMG_IE_HEND5A_Pos);
        else
            PWMG->IE &= ~(0x01 << PWMG_IE_HEND5B_Pos);
        break;
    }
}

/******************************************************************************************************************************************
* 函数名称: PWM_IntHEndClr()
* 功能说明: 高电平结束中断标志清除
* 输    入: PWM_TypeDef * PWMx      指定要被设置的PWM，有效值包括PWM0、PWM1、PWM2、PWM3、PWM4、PWM5
*           uint32_t chn            选择要设置哪个通道，有效值：PWM_CH_A、PWM_CH_B
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void PWM_IntHEndClr(PWM_TypeDef *PWMx, uint32_t chn)
{
    switch ((uint32_t)PWMx)
    {
    case ((uint32_t)PWM0):
        if (chn == PWM_CH_A)
            PWMG->IRS = (0x01 << PWMG_IRS_HEND0A_Pos);
        else
            PWMG->IRS = (0x01 << PWMG_IRS_HEND0B_Pos);
        break;

    case ((uint32_t)PWM1):
        if (chn == PWM_CH_A)
            PWMG->IRS = (0x01 << PWMG_IRS_HEND1A_Pos);
        else
            PWMG->IRS = (0x01 << PWMG_IRS_HEND1B_Pos);
        break;

    case ((uint32_t)PWM2):
        if (chn == PWM_CH_A)
            PWMG->IRS = (0x01 << PWMG_IRS_HEND2A_Pos);
        else
            PWMG->IRS = (0x01 << PWMG_IRS_HEND2B_Pos);
        break;

    case ((uint32_t)PWM3):
        if (chn == PWM_CH_A)
            PWMG->IRS = (0x01 << PWMG_IRS_HEND3A_Pos);
        else
            PWMG->IRS = (0x01 << PWMG_IRS_HEND3B_Pos);
        break;

    case ((uint32_t)PWM4):
        if (chn == PWM_CH_A)
            PWMG->IRS = (0x01 << PWMG_IRS_HEND4A_Pos);
        else
            PWMG->IRS = (0x01 << PWMG_IRS_HEND4B_Pos);
        break;

    case ((uint32_t)PWM5):
        if (chn == PWM_CH_A)
            PWMG->IRS = (0x01 << PWMG_IRS_HEND5A_Pos);
        else
            PWMG->IRS = (0x01 << PWMG_IRS_HEND5B_Pos);
        break;
    }
}

/******************************************************************************************************************************************
* 函数名称: PWM_IntHEndStat()
* 功能说明: 高电平结束中断是否发生
* 输    入: PWM_TypeDef * PWMx      指定要被设置的PWM，有效值包括PWM0、PWM1、PWM2、PWM3、PWM4、PWM5
*           uint32_t chn            选择要设置哪个通道，有效值：PWM_CH_A、PWM_CH_B
* 输    出: uint32_t                1 高电平结束中断已发生    0 高电平结束中断未发生
* 注意事项: 无
******************************************************************************************************************************************/
uint32_t PWM_IntHEndStat(PWM_TypeDef *PWMx, uint32_t chn)
{
    uint32_t int_stat = 0;

    switch ((uint32_t)PWMx)
    {
    case ((uint32_t)PWM0):
        if (chn == PWM_CH_A)
            int_stat = (PWMG->IF & PWMG_IF_HEND0A_Msk);
        else
            int_stat = (PWMG->IF & PWMG_IF_HEND0B_Msk);
        break;

    case ((uint32_t)PWM1):
        if (chn == PWM_CH_A)
            int_stat = (PWMG->IF & PWMG_IF_HEND1A_Msk);
        else
            int_stat = (PWMG->IF & PWMG_IF_HEND1B_Msk);
        break;

    case ((uint32_t)PWM2):
        if (chn == PWM_CH_A)
            int_stat = (PWMG->IF & PWMG_IF_HEND2A_Msk);
        else
            int_stat = (PWMG->IF & PWMG_IF_HEND2B_Msk);
        break;

    case ((uint32_t)PWM3):
        if (chn == PWM_CH_A)
            int_stat = (PWMG->IF & PWMG_IF_HEND3A_Msk);
        else
            int_stat = (PWMG->IF & PWMG_IF_HEND3B_Msk);
        break;

    case ((uint32_t)PWM4):
        if (chn == PWM_CH_A)
            int_stat = (PWMG->IF & PWMG_IF_HEND4A_Msk);
        else
            int_stat = (PWMG->IF & PWMG_IF_HEND4B_Msk);
        break;

    case ((uint32_t)PWM5):
        if (chn == PWM_CH_A)
            int_stat = (PWMG->IF & PWMG_IF_HEND5A_Msk);
        else
            int_stat = (PWMG->IF & PWMG_IF_HEND5B_Msk);
        break;
    }

    return int_stat;
}
